; domain
(define (domain orbital_inspection)

    (:requirements
        :typing
        :strips
        :negative-preconditions
        :numeric-fluents
    )

    (:types
        robot - object

        location - object
        docking - location

        components - object
        sensors - object
    )

    (:predicates
        (robot_at ?r - robot ?l - location)
        (component_at ?c - components ?l - location)
        (location_reachable ?l1 ?l2 - location)
        
        ; which sensor is required for which task
        (requires_sensor ?c - components ?s - sensors)

        ; if the robot has the hardware to do the task
        (has_sensor ?r - robot ?s - sensors)

        ; track the state of the mission
        (checked_component ?r - robot ?c - components ?l - location)
        (data_stored ?c - components)

        ; locking/unlocking movement
        (needs_inspection ?r - robot)
        (charging ?r)

        ; sun
        (sun_present_between ?l1 ?l2 - location)
        (sun_present ?l - location)
        

    )

    
    ;? here we store the resurces
    (:functions
        ; battery
        (battery_level ?r - robot)
        (cost ?l1 ?l2 - location)
        (inspection_cost ?s - sensors)
        

        ; storage  
        (data_size ?c - components)
        (storage_used ?r - robot)
        (storage ?r - robot)
    )


    ;! Movement separated to be with the sun or without the sun
    (:action move_sun
        :parameters (
            ?r - robot 
            ?now ?go - location 
        )
        
        :precondition (and 
            (not (needs_inspection ?r))
            (not (charging ?r))
            (robot_at ?r ?now)
            (location_reachable ?now ?go)
            (sun_present_between ?now ?go)
            (>= (battery_level ?r) (/ (* (cost ?now ?go) 6) 10))
        )
    
        :effect (and 
            (not (robot_at ?r ?now))
            (robot_at ?r ?go)
            ; we supose that while moving the sun compesates 40% of the power
            (decrease (battery_level ?r) (/ (* (cost ?now ?go) 6) 10))

            ;robot must evaluate/inspect the new node before moving again
            (needs_inspection ?r)
        )
    )

    (:action move_without_sun
        :parameters (
            ?r - robot 
            ?now ?go - location 
        )
        :precondition (and 
            (not (needs_inspection ?r))
            (not (charging ?r))
            (robot_at ?r ?now)
            (location_reachable ?now ?go)
            (not (sun_present_between ?now ?go))
            (>= (battery_level ?r) (cost ?now ?go))
        )
        :effect (and 
            (not (robot_at ?r ?now))
            (robot_at ?r ?go)
            ; we supose that while moving the sun compesates 40% of the power
            (decrease (battery_level ?r) (cost ?now ?go))

            ;robot must evaluate/inspect the new node before moving again
            (needs_inspection ?r)
        )
    )

    ;! we just pass the location without inspecting it
    (:action skip_inspection
        :parameters (?r - robot)
        :precondition (needs_inspection ?r)
        :effect (and 
            (not (needs_inspection ?r))
        )
    )


    ;! we inspect if the requirements of tools are met
    (:action inspect_sun
        :parameters (
            ?r - robot
            ?l - location
            ?c - components
            ?s - sensors
        )
        :precondition (and 
            (needs_inspection ?r)
            (sun_present ?l)
            (not (charging ?r))

            (robot_at ?r ?l)
            (component_at ?c ?l)

            (has_sensor ?r ?s)
            (requires_sensor ?c ?s)

            (<= (+ (storage_used ?r) (data_size ?c)) (storage ?r))
            (>= (battery_level ?r) (/ (* (inspection_cost ?s) 2) 10))
        )
        :effect (and 
            (increase (storage_used ?r) (data_size ?c))
            (data_stored ?c)

            ; i chose to reduce by 20, since we are not moving and inspecting is just using the sensors not using the motors of the wheels
            (decrease (battery_level ?r) (/ (* (inspection_cost ?s) 2) 10))

            (checked_component ?r ?c ?l)
            (not (needs_inspection ?r)) ; now we can move
        )
    )

    (:action inspect_without_sun
        :parameters (
            ?r - robot
            ?l - location
            ?c - components
            ?s - sensors
        )
        :precondition (and 
            (needs_inspection ?r)
            (not (sun_present ?l))
            (not (charging ?r))

            (robot_at ?r ?l)
            (component_at ?c ?l)

            (has_sensor ?r ?s)
            (requires_sensor ?c ?s)

            (<= (+ (storage_used ?r) (data_size ?c)) (storage ?r))
            (>= (battery_level ?r) (inspection_cost ?s))
        )
        :effect (and 
            (increase (storage_used ?r) (data_size ?c))
            (data_stored ?c)

            (decrease (battery_level ?r) (inspection_cost ?s))

            (checked_component ?r ?c ?l)
            (not (needs_inspection ?r)) ; now we can move
        )
    )
        
        


    ;! the data is uploaded when we reach the docker
    (:action upload_data
        :parameters (
            ?r - robot 
            ?d - docking
            
        )
        :precondition (and
            (robot_at ?r ?d)
        )
        :effect (and
            (assign (storage_used ?r) 0)
        )
    )

    ;! we charge if the battery is low
    (:action charge_start
        :parameters (
            ?r - robot 
            ?l - location
        )
        ; if the robot has less than 10% and there is the sun it starts to charge on its own
        :precondition (and
            (robot_at ?r ?l)
            (<= (battery_level ?r) 5)
            (sun_present ?l)
            (not (charging ?r))
        )
        :effect (and
            (charging ?r)
        )
    )  

    ; this can loop until max since the ISS has 45 mins sun and 45 night
    (:action charge
        :parameters (
            ?r - robot 
            ?l - location
        )
        :precondition (and 
            (robot_at ?r ?l)
            (charging ?r)
            (sun_present ?l)
            (<= (+ (battery_level ?r) 5) 90) ; we check if the next result is over the cap
        )
        :effect (and 
            (increase (battery_level ?r) 5)
        )
    )

    ; the plannar can stop charging when its sees fit
    (:action stop_charging
        :parameters (?r - robot)
        :precondition (and 
            (charging ?r)
        )
        :effect (and 
            (not (charging ?r))
        )
    )


)

; problem
;; Problem 2: star topology through a hub, three
;; components each needing a different sensor modality, and the
;; location of the radator is always in shade
;;
;; The limited resources
;;
;; 1. STORAGE: cap is 14. data_size(panel)=5, data_size(radiator)=8,
;;    data_size(antenna)=10. All three together = 23 > 14, and no
;;    combination except panel+radiator (=13) fits under the cap
;;    together - antenna must always be uploaded separately. So 
;;    the planner must decide which to inspect together and which alone
;;
;; 2. BATTERY: the robot starts too low (19) to complete the whole
;;    mission without recharging, and radiator-site has no sun, so
;;    charging is only possible before/after that branch, not
;;    during it. The robot must run itself down to the <=5 trigger
;;    at a sunlit hub, run a full charge_start -> charge* ->
;;    stop_charging cycle, and only then dive into the shadowed
;;    radiator branch with enough reserve to get back out.


(define (problem hard_problem)
  (:domain orbital_inspection)

  (:objects
    rob1 - robot
    dock - docking
    hub panel_site radiator_site antenna_site - location
    panel_1 radiator_1 antenna_1 - components
    camera thermal_camera highres_camera - sensors
  )

  (:init
    (robot_at rob1 dock)

    (location_reachable dock hub) (location_reachable hub dock)
    (location_reachable hub panel_site) (location_reachable panel_site hub)
    (location_reachable hub radiator_site) (location_reachable radiator_site hub)
    (location_reachable hub antenna_site) (location_reachable antenna_site hub)

    ;; radiator_site is a permanently shadowed maintenance bay:
    ;; no (sun_present radiator_site) and no sun on the edges to/from it
    (sun_present dock)
    (sun_present hub)
    (sun_present panel_site)
    (sun_present antenna_site)

    (sun_present_between dock hub) (sun_present_between hub dock)
    (sun_present_between hub panel_site) (sun_present_between panel_site hub)
    (sun_present_between hub antenna_site) (sun_present_between antenna_site hub)

    (component_at panel_1 panel_site)
    (requires_sensor panel_1 camera)

    (component_at radiator_1 radiator_site)
    (requires_sensor radiator_1 thermal_camera)

    (component_at antenna_1 antenna_site)
    (requires_sensor antenna_1 highres_camera)

    (has_sensor rob1 camera)
    (has_sensor rob1 thermal_camera)
    (has_sensor rob1 highres_camera)

    (= (battery_level rob1) 19)
    (= (storage_used rob1) 0)
    (= (storage rob1) 14)

    (= (cost dock hub) 10) (= (cost hub dock) 10)
    (= (cost hub panel_site) 10) (= (cost panel_site hub) 10)
    (= (cost hub radiator_site) 8) (= (cost radiator_site hub) 8)
    (= (cost hub antenna_site) 10) (= (cost antenna_site hub) 10)

    (= (inspection_cost camera) 5)
    (= (inspection_cost thermal_camera) 10)
    (= (inspection_cost highres_camera) 10)

    (= (data_size panel_1) 5)
    (= (data_size radiator_1) 8)
    (= (data_size antenna_1) 10)
  )

  (:goal (and
    (checked_component rob1 panel_1 panel_site)
    (checked_component rob1 radiator_1 radiator_site)
    (checked_component rob1 antenna_1 antenna_site)
    (robot_at rob1 dock)
    (= (storage_used rob1) 0)
  ))
)

; plan
1. (move_sun rob1 dock hub)
   deleted: (robot_at rob1 dock)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 19 to 13
   goals met: 1 of 5
2. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 1 of 5
3. (move_sun rob1 hub antenna_site)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 antenna_site) (needs_inspection rob1)
   changed: (battery_level rob1) from 13 to 7
   goals met: 1 of 5
4. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 1 of 5
5. (move_sun rob1 antenna_site hub)
   deleted: (robot_at rob1 antenna_site)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 7 to 1
   goals met: 1 of 5
6. (charge_start rob1 hub)
   added: (charging rob1)
   goals met: 1 of 5
7. (charge rob1 hub)
   changed: (battery_level rob1) from 1 to 6
   goals met: 1 of 5
8. (charge rob1 hub)
   changed: (battery_level rob1) from 6 to 11
   goals met: 1 of 5
9. (charge rob1 hub)
   changed: (battery_level rob1) from 11 to 16
   goals met: 1 of 5
10. (charge rob1 hub)
   changed: (battery_level rob1) from 16 to 21
   goals met: 1 of 5
11. (charge rob1 hub)
   changed: (battery_level rob1) from 21 to 26
   goals met: 1 of 5
12. (charge rob1 hub)
   changed: (battery_level rob1) from 26 to 31
   goals met: 1 of 5
13. (charge rob1 hub)
   changed: (battery_level rob1) from 31 to 36
   goals met: 1 of 5
14. (stop_charging rob1)
   deleted: (charging rob1)
   goals met: 1 of 5
15. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 1 of 5
16. (move_without_sun rob1 hub radiator_site)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 radiator_site) (needs_inspection rob1)
   changed: (battery_level rob1) from 36 to 28
   goals met: 1 of 5
17. (inspect_without_sun rob1 radiator_site radiator_1 thermal_camera)
   deleted: (needs_inspection rob1)
   added: (data_stored radiator_1) (checked_component rob1 radiator_1 radiator_site)
   changed: (storage_used rob1) from 0 to 8, (battery_level rob1) from 28 to 18
   goals met: 1 of 5
18. (move_without_sun rob1 radiator_site hub)
   deleted: (robot_at rob1 radiator_site)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 18 to 10
   goals met: 1 of 5
19. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 1 of 5
20. (move_sun rob1 hub dock)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 dock) (needs_inspection rob1)
   changed: (battery_level rob1) from 10 to 4
   goals met: 2 of 5
21. (upload_data rob1 dock)
   changed: (storage_used rob1) from 8 to 0
   goals met: 3 of 5
22. (charge_start rob1 dock)
   added: (charging rob1)
   goals met: 3 of 5
23. (charge rob1 dock)
   changed: (battery_level rob1) from 4 to 9
   goals met: 3 of 5
24. (stop_charging rob1)
   deleted: (charging rob1)
   goals met: 3 of 5
25. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 3 of 5
26. (move_sun rob1 dock hub)
   deleted: (robot_at rob1 dock)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 9 to 3
   goals met: 2 of 5
27. (charge_start rob1 hub)
   added: (charging rob1)
   goals met: 2 of 5
28. (charge rob1 hub)
   changed: (battery_level rob1) from 3 to 8
   goals met: 2 of 5
29. (charge rob1 hub)
   changed: (battery_level rob1) from 8 to 13
   goals met: 2 of 5
30. (charge rob1 hub)
   changed: (battery_level rob1) from 13 to 18
   goals met: 2 of 5
31. (charge rob1 hub)
   changed: (battery_level rob1) from 18 to 23
   goals met: 2 of 5
32. (stop_charging rob1)
   deleted: (charging rob1)
   goals met: 2 of 5
33. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 2 of 5
34. (move_sun rob1 hub antenna_site)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 antenna_site) (needs_inspection rob1)
   changed: (battery_level rob1) from 23 to 17
   goals met: 2 of 5
35. (inspect_sun rob1 antenna_site antenna_1 highres_camera)
   deleted: (needs_inspection rob1)
   added: (data_stored antenna_1) (checked_component rob1 antenna_1 antenna_site)
   changed: (storage_used rob1) from 0 to 10, (battery_level rob1) from 17 to 15
   goals met: 2 of 5
36. (move_sun rob1 antenna_site hub)
   deleted: (robot_at rob1 antenna_site)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 15 to 9
   goals met: 2 of 5
37. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 2 of 5
38. (move_sun rob1 hub dock)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 dock) (needs_inspection rob1)
   changed: (battery_level rob1) from 9 to 3
   goals met: 3 of 5
39. (upload_data rob1 dock)
   changed: (storage_used rob1) from 10 to 0
   goals met: 4 of 5
40. (charge_start rob1 dock)
   added: (charging rob1)
   goals met: 4 of 5
41. (charge rob1 dock)
   changed: (battery_level rob1) from 3 to 8
   goals met: 4 of 5
42. (charge rob1 dock)
   changed: (battery_level rob1) from 8 to 13
   goals met: 4 of 5
43. (charge rob1 dock)
   changed: (battery_level rob1) from 13 to 18
   goals met: 4 of 5
44. (charge rob1 dock)
   changed: (battery_level rob1) from 18 to 23
   goals met: 4 of 5
45. (stop_charging rob1)
   deleted: (charging rob1)
   goals met: 4 of 5
46. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 4 of 5
47. (move_sun rob1 dock hub)
   deleted: (robot_at rob1 dock)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 23 to 17
   goals met: 3 of 5
48. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 3 of 5
49. (move_sun rob1 hub panel_site)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 panel_site) (needs_inspection rob1)
   changed: (battery_level rob1) from 17 to 11
   goals met: 3 of 5
50. (inspect_sun rob1 panel_site panel_1 camera)
   deleted: (needs_inspection rob1)
   added: (data_stored panel_1) (checked_component rob1 panel_1 panel_site)
   changed: (storage_used rob1) from 0 to 5, (battery_level rob1) from 11 to 10
   goals met: 3 of 5
51. (move_sun rob1 panel_site hub)
   deleted: (robot_at rob1 panel_site)
   added: (robot_at rob1 hub) (needs_inspection rob1)
   changed: (battery_level rob1) from 10 to 4
   goals met: 3 of 5
52. (skip_inspection rob1)
   deleted: (needs_inspection rob1)
   goals met: 3 of 5
53. (charge_start rob1 hub)
   added: (charging rob1)
   goals met: 3 of 5
54. (charge rob1 hub)
   changed: (battery_level rob1) from 4 to 9
   goals met: 3 of 5
55. (stop_charging rob1)
   deleted: (charging rob1)
   goals met: 3 of 5
56. (move_sun rob1 hub dock)
   deleted: (robot_at rob1 hub)
   added: (robot_at rob1 dock) (needs_inspection rob1)
   changed: (battery_level rob1) from 9 to 3
   goals met: 4 of 5
57. (upload_data rob1 dock)
   changed: (storage_used rob1) from 5 to 0
   goals met: 5 of 5
